Revit 2027 API
FabricationNetworkChangeService.GetPartTypeMappingState Method
 Get the state for part type mapping.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool GetPartTypeMappingState()
Public Function GetPartTypeMappingState As Boolean
public:
bool GetPartTypeMappingState()
member GetPartTypeMappingState : unit -> bool
Return Value
Boolean
 Returns true if part type mapping is enabled otherwise false.
See Also
Reference
FabricationNetworkChangeService Class
Autodesk.Revit.DB.Fabrication Namespace